In [11]:
import pandas as pd
import psycopg2 as psy
import sqlalchemy # Thư viện dành cho hiển thị sql trong file

# Import thư viện kết nối với postgresql
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:98919891@153.92.214.210:5432/er_sample')

# Bắt đầu cho phép sử dụng sql trong dòng lệnh
%reload_ext sql

# Khởi tạo kết nối với server database
%sql postgresql://postgres:98919891@153.92.214.210:5432/er_sample

<h1>16.4 演習</h1>

1 血液型が O 型の会員一覧を表示しなさい。業種、職種が設定されていない会員についても表示する必要がある。
結果表は「姓」、「名」、「業種名」、「職種名」を見出しとして表示しなさい。
 - - - -

2 東京都在住の会員が所持するクレジットカード情報の一覧を表示しなさい。結果表は「氏名」、「カード番号」、「有
効期限(YY/MM)」、「クレジットカード会社名」を見出しとして表示しなさい。

---- 

<i>Lấy thông tin về TÊN, SỐ THẺ, NĂM/THÁNG HẾT HẠN, TÊN CÔNG TY TẠO THẺ của các thành viên sử dụng thẻ CREDIT sống ở TOKYO. <i/>

In [10]:
%%sql 
SELECT 
    m.first_name || m.last_name AS "氏名"
    ,mc.card_number AS "カード番号"
    ,mc.expire_year || '/' || mc.expire_MONTH AS "有効期限(YY/MM)"
    ,cc.card_company_name AS "クレジットカード会社名"
FROM    
    member_card AS mc 
    INNER JOIN member AS m 
        ON mc.member_id = m.member_id
    INNER JOIN card_company AS cc 
        ON mc.card_company_id = cc.card_company_id 
WHERE 
    m.address LIKE '東京都%'

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
2 rows affected.

[('明仁内藤', '6666-6666-6666-6666', '15/08', 'ビゼ'),
 ('明仁内藤', '6666-6666-6666-6667', '13/10', 'アメリカンエックス')]

3 2011 年 4 月 1 日以降の注文を全て会員 ID、注文番号順に一覧表示する。結果表は「注文番号」、「氏名」、「有
効期限(YY/MM)」、「クレジットカード会社名」を見出しとして表示しなさい。ただし、有効期限(YY/MM)とクレジット
カード会社名はクレジットカード決済された注文についてのみ表示すればよい。

-- -- 
Lấy thông tin về
    MÃ SỐ ĐƠN ĐẶT HÀNG
    ,TÊN ĐẦY ĐỦ
    ,HẠN SỬ DỤNG THẺ(YY/MM)
    ,TÊN CÔNG TY CẤP THẺ
 của các thành viên đã đặt hàng sau ngày 2011/4/1,
 với trình tự sắp xếp theo ID THÀNH VIÊN -> MÃ ĐƠN ĐẶT HÀNG.
Tuy nhiên,chỉ hiển thị
    HẠN SỬ DỤNG THẺ(YY/MM) 
    và
    TÊN CÔNG TY CẤP THẺ
với các thẻ đã được dùng để đặt hàng.

4 2011 年より前の注文の内訳を一覧表示しなさい。結果表は「注文番号」、「注文日時」、「注文者の氏名」、「書籍
名」を見出しとして表示しなさい。並び順は注文番号、注文明細番号とする。

------
Lấy thông tin :
    MÃ SỐ ĐƠN ĐẶT HÀNG từ bảng order_detail
    ,THỜI GIAN ĐẶT HÀNG từ bảng order_header
    ,TÊN NGƯỜI ĐẶT HÀNG từ bảng member
    ,TÊN SÁCH từ bảng book
của các ĐƠN ĐẶT HÀNG từ trước năm 2011, 
theo trình tự 
    MÃ SỐ ĐƠN ĐẶT HÀNG
    ,CHI TIẾT MÃ ĐƠN ĐẶT HÀNG

In [6]:
%%sql
SELECT 
    od.order_no AS "注文番号"
    ,oh.order_datetime AS "注文日時"
    ,m.last_name || m.first_name AS "注文者の氏名"
    ,b.book_name AS "書籍名"
FROM 
    order_detail AS od 
        INNER JOIN order_header AS oh 
            ON od.order_no = oh.order_no
        INNER JOIN book AS b
            ON od.item_id = b.book_id
        INNER JOIN member AS m 
            ON oh.member_id = m.member_id
WHERE 
    oh.order_datetime < '2011-01-01'

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
9 rows affected.

[('OD000002', datetime.datetime(2010, 5, 9, 18, 24, 58), '野口栄次', '達人開発者'),
 ('OD000001', datetime.datetime(2010, 1, 6, 7, 24, 32), '南有香', 'Effective Ruby 第2版'),
 ('OD000003', datetime.datetime(2010, 6, 11, 11, 22, 32), '田中裕子', '真珠のプログラミング'),
 ('OD000004', datetime.datetime(2010, 6, 18, 12, 21, 12), '山田太郎', 'UNIXネットワークプログラム'),
 ('OD000005', datetime.datetime(2010, 9, 9, 17, 52, 23), '佐藤圭子', '80歳を超えても30代に見える生き方'),
 ('OD000006', datetime.datetime(2010, 9, 21, 8, 32), '内藤明仁', '永遠の1'),
 ('OD000008', datetime.datetime(2010, 12, 31, 19, 45, 42), '森山一郎', '世紀末の隣人'),
 ('OD000001', datetime.datetime(2010, 1, 6, 7, 24, 32), '南有香', 'UNIXネットワークプログラム'),
 ('OD000007', datetime.datetime(2010, 11, 20, 23, 49, 12), '斉藤武', '生物と生物のあいだ')]

5 血液型が O 型の会員の注文について、決済に利用されたカード会社毎の注文回数を求めなさい。結果表は「カー
ド会社 ID」、「決済利用回数」を見出しとして表示しなさい。ただし、クレジットカード決済以外の回数についても一
覧に含めることとし、カード会社 ID には「OTHER」と表示すること。

In [7]:
6 会員毎の 2010 年 12 月 31 日以前の購入金額合計を求めなさい。ただし、書籍1冊分の購入金額は「書籍の価
格-値引き金額」で求めることとする。結果表は「会員 ID」、「購入金額合計」を見出しとして表示しなさい。

SyntaxError: invalid character '。' (U+3002) (3974831030.py, line 1)

In [8]:
7 「講番社」が出版しているカテゴリがノンフィクション以外の書籍を全て一覧表示しなさい。結果表は「書籍 ID」、「書
籍名」、「カテゴリ名」を見出しとして表示しなさい。

SyntaxError: invalid character '「' (U+300C) (4062427071.py, line 1)

In [9]:
8 値引き前の価格が 1000 円以上の書籍を購入したことがある会員の会員 ID、氏名、職種名の一覧を、結果表の
見出しが「会員 ID」、「氏名」、「職種名」となるように表示しなさい。表示順は会員 ID 順で表示しなさい。

SyntaxError: invalid character '、' (U+3001) (3883971608.py, line 1)